# Отчёт о тестировании 

## Краткое описание

12.03.2020 - 12.03.2020 было проведено функциональное тестирование приложения **Precision**.

На тестирование затрачено: 1 час

В результате тестирования выявлены следующие дефекты:
* [деффект 1](https://github.com/pldenn/java3/issues/1)

## Описание процесса тестирования

Входные данные:
*  `public class Main {
      public static void main(String[] args) {
        double regularBonus = 0.3;
        double specialBonus = 0.6;
        double totalBonus = regularBonus + specialBonus;
        System.out.println(totalBonus);
      }
    }`


Тестирование производилось в следующем окружении:
* Windows 7 Профессиональная 64
* Java 11
* IntelliJ IDEA 2019.3.3

